package bg.tu_varna.sit.f24621691.project.cli;

public class HelpCommand extends AbstractCommand {

    public HelpCommand() {
        super("help", "Показва списък с всички налични команди.");
    }

    @Override
    public void execute(String[] args) {
        //Командата help не приема допълнителни аргументи
        validateArgs(args, 1, 1);

        System.out.println("""
            --- DTM Simulator: Налични команди ---
            
            Основни файлови операции:
              open <file path>   - Отваря файл и зарежда машините от него
              close              - Затваря текущия файл и изчиства паметта
              save               - Записва всички промени в текущия файл
              saveas <file path> - Записва текущите данни в нов файл
              help               - Показва това помощно меню
              exit               - Изход от програмата
            
            Управление на машини:
              list               - Показва ID-тата на всички заредени машини
              newtm <id>         - Създава нова празна Тюринг машина
              print <id>         - Извежда информация за машина и нейните преходи
              savetm <id> <file> - Експортира конкретна машина в отделен файл
              loadtm <file>      - Добавя машина от външен файл към текущата сесия
            
            Редактиране и симулация:
              addstate <id> <q>  - Добавя ново състояние към машина
              addtrans <id> ...  - Добавя нов преход
              init <id> <word>   - Инициализира машина с входна дума
              step <id>          - Изпълнява една стъпка
              tape <id>          - Показва съдържанието на лентата
            
            ---------------------------------------
            """);
    }
}