package bg.tu_varna.sit.f24621691.project.cli;

public class HelpCommand implements ICommand {
    @Override
    public void execute(String[] args) {
        System.out.println("""
            --- DTM Simulator: Налични команди ---
            
            Основни файлови операции:
              open <file път>   - Отваря файл и зарежда машините от него
              close             - Затваря текущия файл и изчиства паметта
              save              - Записва всички промени в текущия файл
              saveas <file път> - Записва текущите данни в нов файл
              help              - Показва това помощно меню
              exit              - Изход от програмата
            
            Управление на машини:
              list              - Показва ID-тата на всички заредени машини
              newTM <id>        - Създава нова празна Тюринг машина
              print <id>        - Извежда детайлна информация за машина и нейните преходи
              saveTM <id> <f>   - Експортира конкретна машина в отделен файл
              loadTM <file>     - Добавя машина от външен файл към текущата сесия
            
            Редактиране и Симулация (soon):
              addTrans <id>...  - Добавя нов преход (q, read, q2, write, move)
              init <id> <word>  - Инициализира машина с входна дума на лентата
              step <id>         - Изпълнява една стъпка от работата на машината
            ---------------------------------------
            """);
    }
}